
# App to install macos apps from store
brew 'mas'

# Apps GUI
cask 'ghostty' # Terminal emulator
cask 'podman-desktop' # Containers manager
cask 'raycast' # Spotlight alternative
cask 'rectangle' # Window manager
cask 'alt-tab' # Tabs manager
cask 'zed' # Rust based IDE
cask 'visual-studio-code' # Code editor
cask 'arc' # Chrome based browser
cask 'zen-browser' # Firefox based Browser
cask 'spotify' # Music player
cask 'whatsapp' # Chat app
cask 'telegram' # Chat app
cask 'discord' # Chat app
cask 'figma' # Design tool
cask 'notion' # Notes app
cask 'notion-calendar' # Calendar app
cask 'readdle-spark' # Email client
cask 'chatgpt' # Chatgpt
cask 'jordanbaird-ice' # Menu bar customizer

# Fonts
cask 'font-fira-code-nerd-font'
cask 'font-geist-mono-nerd-font'
cask 'font-jetbrains-mono-nerd-font'

# App store applications
mas 'HandMirror', id: 1502839586 # HandMirror, used to check your webcam
mas 'Unsplash Wallpapers', id: 1284863847 # Unsplash Wallpapers, dynamic wallpapers
mas 'Dashlane', id: 517914548 # Dashlane, password manager
mas 'Flow', id: 1423210932 # Flow, focus timer
mas 'RunCat', id: 1429033973 # RunCat system resources dashboard
